In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    'Name' : ['Ramesh', 'Suresh', 'Satish', np.nan],
    'Age' : [30,33,np.nan,36],
    'City': [np.nan, 'Hyd','Hyd','Blr']
}

In [4]:
data = pd.DataFrame(dict1)

In [5]:
data

     Name   Age City
0  Ramesh  30.0  NaN
1  Suresh  33.0  Hyd
2  Satish   NaN  Hyd
3     NaN  36.0  Blr

In [6]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [7]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [9]:
data.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
dict1 = {
    'Name' : ['Ramesh', 'Suresh', 'Satish', np.nan],
    'Age' : [30,33,np.nan,36],
    'City': [np.nan, 'Hyd','Hyd','Blr'],
    'Company': ['Google', 'Microsoft', 'Apple', 'Meta']
}
data = pd.DataFrame(dict1)
data

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [12]:
data.dropna()

     Name   Age City    Company
1  Suresh  33.0  Hyd  Microsoft

In [13]:
data.dropna(axis = 1)

     Company
0     Google
1  Microsoft
2      Apple
3       Meta

### fillna

In [14]:
data.fillna(1)

     Name   Age City    Company
0  Ramesh  30.0    1     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   1.0  Hyd      Apple
3       1  36.0  Blr       Meta

In [15]:
data['Age'].fillna(0)

0    30.0
1    33.0
2     0.0
3    36.0
Name: Age, dtype: float64

In [16]:
data['Name'].fillna('Chinna')

0    Ramesh
1    Suresh
2    Satish
3    Chinna
Name: Name, dtype: object

In [18]:
data['City'].fillna('Del')

0    Del
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

- This method is not good as it fills all the values with same value

- To avoid, we have some methods which follow a pattern
    - backfill
    - bfill
    - ffill
    - pad

### backfill

In [20]:
data

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [19]:
data.backfill()

C:\Users\ameen\AppData\Local\Temp\ipykernel_30808\4241567333.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  data.backfill()

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [21]:
data.bfill()

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [23]:
data.ffill()

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  Blr       Meta

In [24]:
data.pad()

C:\Users\ameen\AppData\Local\Temp\ipykernel_30808\3916484080.py:1: FutureWarning: DataFrame.pad/Series.pad is deprecated. Use DataFrame.ffill/Series.ffill instead
  data.pad()

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  Blr       Meta

In [25]:
import warnings
warnings.filterwarnings('ignore')

In [27]:
data.pad(axis = 1)

     Name     Age  City    Company
0  Ramesh    30.0  30.0     Google
1  Suresh    33.0   Hyd  Microsoft
2  Satish  Satish   Hyd      Apple
3     NaN    36.0   Blr       Meta

In [28]:
data.backfill(axis = 1)

     Name   Age    City    Company
0  Ramesh  30.0  Google     Google
1  Suresh  33.0     Hyd  Microsoft
2  Satish   Hyd     Hyd      Apple
3    36.0  36.0     Blr       Meta

### Mean-Median-Mode

In [32]:
data

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [34]:
data['Age'].fillna(data['Age'].mean())

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [35]:
data['Age'].fillna(data['Age'].median())

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [41]:
data['City'].fillna(data['City'].mode())

0    Hyd
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

In [44]:
data['City'].mode() # will return series

0    Hyd
Name: City, dtype: object

In [45]:
data['City'].mode().values[0] # will return a single value

'Hyd'

### impute class
- under sklearn we have impute class

In [46]:
from sklearn import impute

In [47]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

### KNN imputer

-

In [49]:
import numpy as np
from sklearn.impute import KNNImputer

X = [[1,2,np.nan], [3,np.nan,3], [np.nan,60,5], [8,8,7]]
imputer = KNNImputer(n_neighbors = 2, weights = 'uniform')
imputer.fit_transform(X)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [50]:
import numpy as np
from sklearn.impute import KNNImputer

X = [[1,2,np.nan], [3,np.nan,3], [np.nan,60,5], [8,8,7]]
imputer = KNNImputer(n_neighbors = 2, weights = 'distance')
imputer.fit_transform(X)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])